<?php

/**
 * 数据导入时的 数据对应文件
 * 
 */

return array(
    // 城市信息，key为原始数据的city_id, value为本系统数据的city_id
    'city' => array(
        1 => 289,   //广州
        2 => 291,   //深圳
        3 => 292,   //珠海
        4 => 305,   //东莞
        5 => 294,   //佛山
        6 => 306,   //中山
        7 => 299,   //惠州
        8 => 293,   //汕头
        9 => 295,   //江门
        10 => 297,   //茂名
        11 => 298,   //肇庆
        12 => 296,   //湛江
        13 => 300,   //梅州
        14 => 301,   //汕尾
        15 => 302,   //河源
        16 => 304,   //清远
        17 => 290,   //韶关
        18 => 308,   //揭阳
        19 => 303,   //阳江
        20 => 307,   //潮州
        21 => 309,   //云浮
        22 => 310,   //广西省 南宁市
        23 => 324,   //海南省 海口市
        24 => 415,   //云南省 昆明市
        25 => 574,   //香港 
        26 => 162,   //江苏省 南京市
        27 => 175,   //浙江省 杭州市
        28 => 203,   //福建省 福州市
        29 => 258,   //湖北省 武汉市
        30 => 575,   //其他 其他
    ),
    
    // 城市信息，key为原始数据的category_id, value为本系统数据的variety_id
    // 2017年3月27日16:12:20 兼容老数据时，测试发现谁TM SB 把 214 给删除了，现在变成215了，所以改成 215
    'variety' => array(
        3 => 9,  //金钱龟 金钱龟
        4 => 90,  //南种石龟 黄喉拟水龟
        5 => 90,  //大青北龟 黄喉拟水龟
        6 => 211,  //黑颈乌龟 黑颈乌龟
        7 => 13,  //黄缘龟   黄缘闭壳龟
        8 => 93,  //安南龟   安南龟
        9 => 212,  //鳄龟 鳄鱼龟
        10 => 94,  //草龟    中华草龟
        11 => 215,  //闭盒龟  其他
        12 => 213,  //杂交变异    杂交变异龟
        13 => 215,  //宠物龟  其他
        14 => 215,  //综合类龟    其他
        15 => 215,  //龟饲料  其他
        16 => 215,  //龟药    其他
        17 => 215,  //龟器材  其他
        18 => 215,  //龟文化类    其他
        19 => 215,  //龟产品  其他
        20 => 215,  //龟蛋龟苗    其他
    )
);
